export type RegionModel = {
  name: string
  cities: string[]
}

export const regionList: RegionModel[] = [
  {
    name: 'Омская область',
    cities: [
      'Исилькуль',
      'Калачинск',
      'Называевск',
      'Омск',
      'Тара',
      'Тюкалинск',
    ]
  },

  {
    name: 'Алтайский край',
    cities: [
      'Барнаул',
      'Алейск',
      'Белокуриха',
      'Бийск',
      'Горняк',
      'Заринск',
      'Змеиногорск',
      'Камень-на-Оби',
      'Новоалтайск',
      'Рубцовск',
      'Славгород',
      'Яровое',
    ]
  },
  {
    name: 'Республика Алтай',
    cities: [
      'Горно-Алтайск',
    ]
  }
]
