import { useParams } from "react-router-dom"

export const ReportItem = () => {
  const { id } = useParams()
  const isCreate = id === 'new'

  return (
    <div>
      Страница {isCreate && 'создания '}отчета
      <div>
      Субъект права
ОГРН
дата государственной регистрации

      </div>
      <div>Вид права</div>
      <div>
      Объект права	Здание магазина с пристроем, назначение: нежилое	
Адрес (местоположение)	Россия, Алтайский кр., г. Барнаул, пр-кт Космонавтов, д. 33	
Кадастровый номер	22:63:020309:26	
Количественные и качественные характеристики объекта оценки		
Площадь: общая, м²	2555	
Этажность	4	
Подземная этажность	1	
Кадастровый номер	22:63:020309:26	
Право	Собственность № 22-22-01/135/2012-213 от 19.04.2012	
Ограничение	"Аренда № 22-22-01/035/2012-372 от 09.04.2012
Ипотека № 22:63:020309:26-22/001/2020-23 от 18.03.2020
Ипотека № 22:63:020309:26-22/001/2019-20 от 21.02.2019
№ 22:63:020309:26-22/111/2021-26 отсутствует
Аренда № 22:63:020309:26-22/111/2021-25 от 19.04.2021"	
Кадастровая стоимость, руб	34 069 000,00	
Арендуемая площадь (суммарно), м²	1 147,02	
Арендная плата (суммарно), руб/мес.	359 710,30	
Оплата коммунальных расходов	Возложена на арендатора (перевыставление расходов пропорционально занятой площади)	
Литер	АА1	
Год постройки	1959-1980	
Этаж/Этажность	подвал,1,2,3/3	
Износ, %	25-27	
Площадь подвала, м²	659	
Площадь 1-го этажа, м²	765,4	
Площадь 2-го и выше этажей, м²	1130,6	
Выявленные несогласованные перепланировки/переустройства	Перепланировки, не отраженные в технической документации, отсутствуют	
Конструктивные элементы	Материал	Признаки износа
Стены	кирпич, керамогранит (частично)	отдельные повреждения, трещины в кладке
Перекрытия	железобетонные	нет видимых признаков износа
Проемы	двери пластиковые, металлические и деревянные; окна пластиковые	отдельные незначительные повреждения
Полы	плитка, линолеум, бетонный	
Отделка	покраска, кафель, потолки "Армстронг"	отдельные повреждения и загрязнения
Коммуникации	электричество, водоснабжение, канализация, отопление, вентиляция	в рабочем состоянии
Общая характеристика состояния объекта		хорошее
Текущее использование / назначение помещений объекта		торгово-офисные (с бытовыми, складскими и подсобными)
Балансовая (остаточная) стоимость, руб		9 618 502,48

      </div>
      <div>
      "Субъект права
ОГРН
дата государственной регистрации
"	"ООО ""ГАРАНТИЯ""
1122224001855
09.04.2012
Общество с ограниченной ответственностью ""Гарантия"""		https://egrul.nalog.ru/
			Копия Выписки из ЕГРН № 22/363/003/2018-896 от 06.04.2018 г.
Вид права	собственность, краткосрочная аренда, долгосрочная аренда		
номер и дата государственной регистрации права	22-22-01/135/2012-219, 19.04.2012 г.		
Наименование объекта	Земельный участок		
Адрес	край Алтайский, г. Барнаул, пр-кт Космонавтов, дом 33		
Кадастровый номер	22:63:020309:2		
Кадастровые номера расположенных в пределах земельного участка объектов недвижимости	"22:63:020309:26
22:63:020309:53
22:63:020309:54"		
Количественные и качественные характеристики объекта оценки			
Площадь, м²	1666		
Категория земель	Земли населенных пунктов		
Разрешенное использование	Для эксплуатации здания магазина		
Кадастровый номер	22:63:020309:2		https://lk.rosreestr.ru/eservices/real-estate-objects-online
Право	Собственность № 22-22-01/135/2012-219 от 19.04.2012		
Ограничение	"Ипотека № 22:63:020309:2-22/001/2020-10 от 18.03.2020
Ипотека № 22:63:020309:2-22/001/2019-9 от 21.02.2019
Аренда от 22.09.2005
Ограничения прав на земельный участок, предусмотренные статьей 56 Земельного кодекса Российской Федерации от 13.10.2020
Ограничения прав на земельный участок, предусмотренные статьей 56 Земельного кодекса Российской Федерации от 11.01.2021"		
Кадастровая стоимость, руб.	5 669 781,18		
Кадастровые номера и наименования расположенных на участке объектов капитального строительства, права на которые зарегистрированы	22:63:020309:26	Магазин	
	22:63:020309:53	Тепловая сеть	
	22:63:020309:54	Тепловая сеть	
Наличие на участке строений, права на которые не зарегистрированы	2 кирпичных здания (ориентировочная площадь 2-4 кв.м, подсобно-складского назначения), 3 металлических склада/гаража		Визуальный осмотр оценщика
Примечание	По мнению Оценщика, наличие на участке вышеупомянутого незарегистрированного строения никак не влияет на стоимость участка при текущем использовании		
Текущее использование	застроен объектом коммерческой недвижимости		
Балансовая стоимость, руб	297 132,35		Справка о балансовой стоимости ООО "Гарантия"

      </div>
      <div></div>
      <div></div>
      <div></div>
      <div></div>
      <div></div>
      <div></div>
    </div>
  )
}
